In [2]:
import pandas as pd

salaries = pd.read_csv('salaries-population.csv')
salaries

   value
0  33219
1  36254
2  38801
3  46335
4  46840
5  47596
6  55130
7  56863
8  78070
9  88830

In [14]:
salaries['value'].mean()

52793.8

In [15]:
salaries['deviation from mean'] = (salaries['value'] - salaries['value'].mean())
salaries

   value  deviation from mean
0  33219            -19574.80
1  36254            -16539.80
2  38801            -13992.80
3  46335             -6458.80
4  46840             -5953.80
5  47596             -5197.80
6  55130              2336.20
7  56863              4069.20
8  78070             25276.20
9  88830             36036.20

In [16]:
salaries['deviation from mean'].mean()

-2.9103830456733705e-12

In [17]:
salaries['absolute deviations'] = abs(salaries['deviation from mean'])
salaries

   value  deviation from mean  absolute deviations
0  33219            -19574.80             19574.80
1  36254            -16539.80             16539.80
2  38801            -13992.80             13992.80
3  46335             -6458.80              6458.80
4  46840             -5953.80              5953.80
5  47596             -5197.80              5197.80
6  55130              2336.20              2336.20
7  56863              4069.20              4069.20
8  78070             25276.20             25276.20
9  88830             36036.20             36036.20

In [18]:
salaries['absolute deviations'].mean()

13543.560000000001

In [19]:
pd.set_option('display.float_format', lambda x: '%.2f' % x)
salaries['squared deviations'] = salaries['deviation from mean'] ** 2
salaries

   value  deviation from mean  absolute deviations  squared deviations
0  33219            -19574.80             19574.80        383172795.04
1  36254            -16539.80             16539.80        273564984.04
2  38801            -13992.80             13992.80        195798451.84
3  46335             -6458.80              6458.80         41716097.44
4  46840             -5953.80              5953.80         35447734.44
5  47596             -5197.80              5197.80         27017124.84
6  55130              2336.20              2336.20          5457830.44
7  56863              4069.20              4069.20         16558388.64
8  78070             25276.20             25276.20        638886286.44
9  88830             36036.20             36036.20       1298607710.44

In [20]:
variance = salaries['squared deviations'].mean()
variance

291622740.36

In [21]:
import math
math.sqrt(variance)

17076.965197598784

http://stats.stackexchange.com/questions/118/why-square-the-difference-instead-of-taking-the-absolute-value-in-standard-devia

https://www.quora.com/Why-do-we-square-instead-of-using-the-absolute-value-when-calculating-variance-and-standard-deviation

In [22]:
salaries_sample = pd.read_csv('salaries-sample.csv')
salaries_sample

   sample
0   38946
1   43420
2   49191
3   50430
4   50557
5   52580
6   53595
7   54135
8   60181
9   62076

In [55]:
salaries_sample['sample'].std(ddof=0)

6557.163265467774

In [28]:
sample_sn_salary = pd.read_csv('Sample Social Networkers Salary n=100 - Lesson 4 - Sheet1.csv')
sample_sn_salary_mean = sample_sn_salary['salary'].mean()
sample_sn_salary['2. deviation (x-xbar)'] = (sample_sn_salary['salary'] - sample_sn_salary_mean)
sample_sn_salary['3. squared deviation (x-xbar)^2'] = sample_sn_salary['2. deviation (x-xbar)'] ** 2
sample_sn_salary['1. In this cell, find the average of cells a2 through a101.'][0] = sample_sn_salary_mean
sample_sn_salary['4. In this cell, find the average of cells c2 through c101.'][0] = sample_sn_salary['3. squared deviation (x-xbar)^2'].mean()
sample_sn_salary['5. Finally, take the square root of the calculation described in cell f1.'][0] = math.sqrt(sample_sn_salary['4. In this cell, find the average of cells c2 through c101.'][0])
sample_sn_salary.head()

,salary,2. deviation (x-xbar),3. squared deviation (x-xbar)^2,Unnamed: 3,"1. In this cell, find the average of cells a2 through a101.","4. In this cell, find the average of cells c2 through c101.","5. Finally, take the square root of the calculation described in cell f1."
0,59147.29,8560.93,73289465.96,nan,50586.36,113570640.18,10656.95
1,61379.14,10792.78,116484028.90,nan,nan,nan,nan
2,55683.19,5096.83,25977642.41,nan,nan,nan,nan
3,56272.76,5686.40,32335107.43,nan,nan,nan,nan
4,52055.88,1469.52,2159479.33,nan,nan,nan,nan

In [29]:
205/9

22.77777777777778

In [39]:
sample_sd = pd.DataFrame({'sample' : [18,20,23,18,21,17,22,21,15]})
sample_sd

   sample
0      18
1      20
2      23
3      18
4      21
5      17
6      22
7      21
8      15

In [42]:
sample_sd['sample'].std(ddof=0)

2.454524670486058

In [43]:
sample_sd['sample'].sum()

175